app/controllers/articles_controller.rb

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2020-04-27 17:41:28.148379"], ["id", 1]]
---
  def edit
    @article = Article.find(params[:id])
    @article.update(title: params[:article][:title], description: params[:article][:description])